---
kind: property
id: P:Autodesk.Revit.DB.UV.U
source: html/ce182f44-281b-1892-fada-82fc84b143a3.htm
---
# Autodesk.Revit.DB.UV.U Property

Gets the first coordinate.

## Syntax (C#)
```csharp
public double U { get; }
```